{
    "recipeName": [
        "Candy Corn"
    ],
    "recipeCategory": [
        "Dessert"
    ],
    "recipeSource": [
        ""
    ],
    "recipeLink": [
        ""
    ],
    "directions": [
        "[[\"In a medium sized bowl, combine the sifted confectioners' sugar and powdered milk. Set to the side.\"],[\"In a medium saucepan, combine the granulated sugar, corn syrup and butter. Bring to a boil on high heat, stirring constantly. Once it reaches the boiling point, reduce heat to medium and continue stirring for about 5 minutes, stirring occasionally. Stir in the vanilla extract and remove from heat.\"],[\"Add the confectioners' sugar and powdered milk mixture to the wet ingredients; stir well until the mixture is thoroughly incorporated and smooth.\"],[\"Let the dough cool until it is firm enough to handle, about 30 minutes to an hour (I just let it cool in the saucepan).\"],[\"Divide the dough into three equal parts and set each third into a separate bowl. Add 2 to 3 drops of yellow food coloring to one dish, one drop of red and two drops of yellow to another dish, and leave the remaining dish uncolored. Knead the dough to which you have added food coloring until the color is even (you may want to use gloves to ensure that you don't stain yourself). If the dough is feeling very soft or sticky, you may want to chill the dough for about 20 minutes in the refrigerator before proceeding with the next steps.\"],[\"On top of a sheet of waxed paper or parchment paper, use your hands to roll each color of dough into a long, slender rope. You can roll it out to your desired thickness: for larger candies, make each rope thicker; for smaller candies, make each rope thinner.\"],[\"Line the three ropes of dough together: white, orange, and yellow. To ensure that they will stick together, lay a piece of waxed paper on top and give them a very gentle rolling with a rolling pin. You just want to adhere them, not to flatten them.\"],[\"Using a very sharp knife, cut the dough into triangles. Keep a damp cloth nearby so that you can wipe off the knife if it begins to get a candy residue. This method will result in half a batch of traditionally colored candy corn and half a batch with yellow tips (it's OK—they taste the same). Let the finished kernels sit for an hour or two (do not stack them on top of one another as they will stick together!) to become firm.\"],[\"\"],[\"\"]]"
    ],
    "timestamp": [
        "20201212-023449"
    ],
    "notes": [
        ""
    ],
    "winePairing": [
        ""
    ],
    "ingredients": [
        "[{\"number\":[\"1\"],\"units\":[\"Cup(s)\"],\"name\":[\"Granulated sugar\"],\"category\":[\"\"]},{\"number\":[\"2/3\"],\"units\":[\"Cup(s)\"],\"name\":[\"Light corn syrup\"],\"category\":[\"\"]},{\"number\":[\"1/3\"],\"units\":[\"Cup(s)\"],\"name\":[\"Salted butter\"],\"category\":[\"\"]},{\"number\":[\"5/2\"],\"units\":[\"Cup(s)\"],\"name\":[\"Powdered sugar\"],\"category\":[\"\"]},{\"number\":[\"1/3\"],\"units\":[\"Cup(s)\"],\"name\":[\"Powdered milk\"],\"category\":[\"\"]},{\"number\":[\"1\"],\"units\":[\"Teaspoon(s)\"],\"name\":[\"Vanilla extract\"],\"category\":[\"\"]},{\"number\":[\"1\"],\"units\":[\"Pinch(es)\"],\"name\":[\"Red and yellow food coloring\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"],\"category\":[\"\"]}]"
    ]
}

