{
    "recipeName": [
        "Pizza Dough"
    ],
    "recipeCategory": [
        "Breads"
    ],
    "recipeSource": [
        "http://www.foodnetwork.com/recipes/tyler-florence/pizza-dough-recipe.html"
    ],
    "directions": [
        "[[\"In the bowl of a standing electric mixer fitted with a dough hook, combine the yeast, sugar, and warm water; stir gently to dissolve. Let the mixture stand until the yeast comes alive and starts to foam, about 5 to 10 minutes.\"],[\"Turn the mixer on low and add the salt and 2 tablespoons of olive oil. Add the flour, a little at a time, mixing at the lowest speed until all the flour has been incorporated. When the dough starts to come together, increase the speed to medium; stop the machine periodically to scrape the dough off the hook. Get a feel for the dough by squeezing a small amount together: if it's crumbly, add more water; if it's sticky, add more flour - 1 tablespoon at a time. Mix until the dough gathers into a ball, this should take about 5 minutes.\"],[\"Turn the dough out onto a lightly floured surface and fold it over itself a few times; kneading until it's smooth and elastic. Form the dough into a round and place in a lightly oiled bowl, turn it over to coat. Cover with plastic wrap or a damp towel and let it rise in a warm spot (i.e. over a gas pilot light) until doubled in size, about 1 hour. This is a good time to stick a pizza stone in the oven and preheat them to 500 degrees F.\"],[\"Once the dough is domed and spongy, turn it out onto a lightly floured counter. Roll and stretch the dough into a cylinder and divide into 3 equal pieces. Cover and let rest for 10 minutes so it will be easier to roll out.\"],[\"Roll or pat out a piece of dough into a 12 inch circle, about 1/8-inch thick. Dust a pizza paddle with flour and slide it under the pizza dough. Brush the crust with a thin layer of olive oil, and top with your favorite flavors. Slide the pizza onto the hot stone in the oven and bake for 12 to 15 minutes, until the crust is golden and crisp. Repeat with the remaining dough.\"],[\"\"],[\"\"],[\"\"],[\"\"],[\"\"]]"
    ],
    "timestamp": [
        "20160922-210638"
    ],
    "notes": [
        "Makes 2 pizzas worth."
    ],
    "ingredients": [
        "[{\"number\":[\"1\"],\"units\":[\"Whole\"],\"name\":[\"Package active dry yeast\"]},{\"number\":[\"1\"],\"units\":[\"Teaspoon(s)\"],\"name\":[\"Sugar\"]},{\"number\":[\"1\"],\"units\":[\"Cup(s)\"],\"name\":[\"Warm water\"]},{\"number\":[\"1\"],\"units\":[\"Tablespoon(s)\"],\"name\":[\"Kosher salt\"]},{\"number\":[\"3\"],\"units\":[\"Cup(s)\"],\"name\":[\"Flour\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]},{\"number\":[\"\"],\"units\":[\"\"],\"name\":[\"\"]}]"
    ]
}

